# 使用Python语言编写
# 开发时间 2023/7/13 11:21

# 运算符的优先级
# | 运算符                      | 描述                                 |
# |--------------------------|------------------------------------|
# | **                       | 指数 (最高优先级)                         |
# | ~ + -                    | 按位翻转, 一元加号和减号 (最后两个的方法名为 +@ 和 -@)  |
# | * / % //                 | 乘，除，取模和取整除                         |
# | + -                      | 加法减法                               |
# | >> <<                    | 右移，左移运算符                           |
# | &                        | 位 'AND'                            |
# | ^ |                      | 位运算符                               |
# | <= < > >=                | 比较运算符                              |
# | <> == !=                 | 等于运算符                              |
# | = %= /= //= -= += *= **= | 赋值运算符                              |
# | is is not                | 身份运算符                              |
# | in not in                | 成员运算符                              |
# | not and or               | 逻辑运算符                              |
